// alert("Привет, мир");
// =================================================================
/* можно поместить в функцию*/
// function hello() {   
//     let userName = 'nata';
//     alert(`Привет ${userName}`);
// }
// hello();
// =================================================================
// let result = 158+2;
// alert(`Привет ${result}`);
// =================================================================
// let userName = prompt('Введите имя');
// alert(`Hello, ${userName}`);
// =================================================================
// вызвать диалоговое окно с заголовком «Как вас зовут?» и подсказкой «Имя» в поле ввода. Затем вывести имя, которое ввели.
// let userName = prompt('Введите имя', 'Имя');
// alert(`Hello, ${userName}`);
// =================================================================
// написать функцию, выводящую в диалоговом окне текст и переменную. Например, «Привет, Алевтина». Где «Алевтина» — это внешняя переменная.
// let userName = 'alex';
// function showName() {
//     alert(`Hello, ${userName}`)
// }

// showName();
// =================================================================
// let result = confirm('Вы уверенны?')
// if(result) {
//     alert('Хорошо что уверенны')
// }
// else{
//     alert('Жаль, что не уверенны')
// }
// =================================================================
// let age = 18;

// switch (age) {
//     case 18:
//         alert('Вы совершеннолетний!Все можно!');
//         break;
//     case 10:
//         alert('Вам надо учить уроки!');
//         break;
//     case 30:
//         alert('Ложись спать, завтра на работу!');
//         break;
//     default:
//         alert('Мы не знаем что Вам делать!');
// }
// если break не будет, функция будет проваливаться (выдавать значения каждого кейса). 
// Проваливания полезны когда нам нужно для несольких кейсов выполнить один и тот же код

let day = prompt('Введите день');

switch (day) {
    case 'пн':
    case 'вт':
    case 'ср':
    case 'чт':
    case 'пт':
        alert('рабочий день');
        break;
    case 'сб':
    case 'вс':
        alert('выходной день');
        break;
    default:
        alert('мы такого дня не знаем!!!');
}